app/Controllers/Home.php

SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        // Vérifier que les vues existent
        if (!file_exists(APPPATH . 'Views/inc/header.php') ||
            !file_exists(APPPATH . 'Views/inc/home.php') ||
            !file_exists(APPPATH . 'Views/inc/footer.php')) {
            throw new \Exception('One or more view files are missing');
        }

        // Charger les parties de la vue
        $header = view('inc/header');
        $data['users'] = $this->user->orderBy('id', 'DESC')->paginate(3, 'group1'); // Récupérer les utilisateurs paginés